In [2]:
import numpy as np
import pandas as pd
shanghai_ranking = pd.read_csv('data/Shanghai_ranking_data_2023.csv')
THE_ranking = pd.read_csv('data/THE_ranking_data_2023.csv')
qs_ranking = pd.read_csv('data/QS_ranking_data_2023.csv')

In [3]:
# THE_ranking = pd.read_csv('data/THE_ranking_data.csv')
# for index, item in enumerate(THE_ranking.RankTHE):
#     item = item.replace('–','-')
#     THE_ranking.at[index,'RankTHE'] = item
# THE_ranking.to_csv('output.csv')

In [4]:
THE_ranking=THE_ranking.drop(np.where(THE_ranking.RankTHE=='Reporter')[0])
THE_ranking

,Unnamed: 0,RankTHE,Name,No. of FTE students,No. of students per staff,International Students,Female:Male Ratio,Overall,Teaching,Research Environment,Research Quality,Industry,International Outlook
0,0,1,University of Oxford,"20,965",10.6,42%,48 : 52,96.4,92.3,99.7,99.0,74.9,96.2
1,1,2,Harvard University,"21,887",9.6,25%,50 : 50,95.2,94.8,99.0,99.3,49.5,80.5
2,2,=3,University of Cambridge,"20,185",11.3,39%,47 : 53,94.8,90.9,99.5,97.0,54.2,95.8
3,3,=3,Stanford University,"16,164",7.1,24%,46 : 54,94.8,94.2,96.7,99.8,65.0,79.8
4,4,5,Massachusetts Institute of Technology,"11,415",8.2,33%,40 : 60,94.2,90.7,93.6,99.8,90.9,89.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1653,1653,1501+,West University of Timişoara,"14,527",24.6,6%,66 : 34,10.4–18.3,18.7,13.4,16.8,37.7,28.7
1654,1654,1501+,Wrocław University of Science and Technology,"23,657",20.3,6%,35 : 65,10.4–18.3,17.9,16.0,14.9,45.5,27.3
1655,1655,1501+,Yamaguchi University,"10,724",11.1,7%,38 : 62,10.4–18.3,21.3,12.3,13.9,43.8,30.4
1656,1656,1501+,Yanshan University,"38,649",13.2,1%,39 : 61,10.4–18.3,17.2,10.9,18.3,46.9,17.0
1657,1657,1501+,Yeditepe University,"17,038",28.2,5%,55 : 45,10.4–18.3,18.8,12.2,10.5,65.7,29.6

In [5]:
def merge(Rank1, Rank2, bias):
    import Levenshtein
    distance = np.empty((len(Rank1.Name),len(Rank2.Name)))
    Rank1 = Rank1.rename(columns={'Name':'Name1'})
    Rank2 = Rank2.rename(columns={'Name':'Name2'})
    for index1, rank1 in enumerate(Rank1.Name1):
        for index2, rank2 in enumerate(Rank2.Name2):
            distance[index1, index2] = Levenshtein.distance(rank1, rank2)
    merged_rank = pd.DataFrame({})
    for i in range(distance.shape[0]):
        j = np.argmin(distance[i, :])
        if distance[i, j] == bias:
            # print('i:',i,'j:',j)
            merged_row = pd.concat([Rank1.iloc[i], Rank2.iloc[j]], axis=0)
            merged_row = merged_row.to_frame().T
            merged_rank = pd.concat([merged_rank, merged_row])
    merged_rank = merged_rank.reset_index(drop=True)
    return merged_rank

def clean(merged_rank, row=[]):
    for i in row:
        merged_rank = merged_rank.drop(i)
    merged_rank = merged_rank.drop('Name2',axis=1)
    merged_rank = merged_rank.rename(columns={'Name1':'Name'}).reset_index(drop=True)
    return merged_rank

In [6]:
merged_rank1 = merge(shanghai_ranking,qs_ranking,0)
merged_rank1 = clean(merged_rank1)
merged_rank2 = merge(shanghai_ranking,qs_ranking,1)
merged_rank2 = clean(merged_rank2)
merged_rank = pd.concat([merged_rank1,merged_rank2])
merged_rank = merged_rank.reset_index(drop=True)
merged_rank

,RankShangHai,Name,Region,Regional rank,Total score,Alumni,Award,Hici,N&S,PUB,...,cpf rank,ifr score,ifr rank,isr score,isr rank,irn score,irn rank,ger score,ger rank,score scaled
0,1,Harvard University,us,1,100.0,100.0,92.6,100.0,100.0,100.0,...,2,76.9,228,66.9,212,100.0,1,100.0,1,97.6
1,2,Stanford University,us,2,74.8,45.6,88.1,73.6,82.8,67.5,...,9,99.8,74,60.3,235,96.3,55,100.0,2,98.5
2,4,University of Cambridge,gb,1,67.9,78.9,90.8,45.1,61.0,63.6,...,55,100.0,60,96.3,70,99.5,6,100.0,9,98.8
3,6,Princeton University,us,5,60.1,61.7,100.0,32.9,50.4,39.4,...,3,26.0,515,62.2,226,78.5,340,100.0,8,89.2
4,7,University of Oxford,gb,2,59.5,49.9,59.7,51.4,57.6,71.4,...,64,98.8,101,98.4,54,99.9,3,100.0,7,98.4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
484,901-1000,Nicolaus Copernicus University,pl,5月9日,NaN,10.1,0.0,0.0,5.2,23.0,...,601+,3.6,601+,3.9,601+,71.5,441,5.2,601+,-
485,901-1000,Southern Cross University,au,31-34,NaN,21.9,0.0,0.0,7.3,15.1,...,393,73.5,243,88.1,120,57.3,601+,7.1,601+,-
486,901-1000,Tokyo University of Agriculture and Technology,jp,29-32,NaN,15.8,0.0,0.0,6.9,17.3,...,335,5.6,601+,6.4,601+,46.2,601+,5.1,601+,-
487,901-1000,Universidad Andr茅s Bello,cl,3月4日,NaN,8.6,0.0,6.6,2.9,18.7,...,601+,8.0,601+,2.2,601+,45.7,601+,4.3,601+,-
488,901-1000,Universidade Federal de Pelotas,br,15-18,NaN,8.8,0.0,6.6,1.4,19.2,...,601+,NaN,NaN,1.4,601+,23.3,601+,6.3,601+,-

In [7]:
merged_rank1 = merge(merged_rank,THE_ranking,0)
merged_rank1 = clean(merged_rank1)
merged_rank2 = merge(merged_rank,THE_ranking,1)
merged_rank2 = clean(merged_rank2)
merged_rank = pd.concat([merged_rank1,merged_rank2])
merged_rank = merged_rank.reset_index(drop=True)
merged_rank

,RankShangHai,Name,Region,Regional rank,Total score,Alumni,Award,Hici,N&S,PUB,...,No. of FTE students,No. of students per staff,International Students,Female:Male Ratio,Overall,Teaching,Research Environment,Research Quality,Industry,International Outlook
0,1,Harvard University,us,1,100.0,100.0,92.6,100.0,100.0,100.0,...,"21,887",9.6,25%,50 : 50,95.2,94.8,99.0,99.3,49.5,80.5
1,2,Stanford University,us,2,74.8,45.6,88.1,73.6,82.8,67.5,...,"16,164",7.1,24%,46 : 54,94.8,94.2,96.7,99.8,65.0,79.8
2,4,University of Cambridge,gb,1,67.9,78.9,90.8,45.1,61.0,63.6,...,"20,185",11.3,39%,47 : 53,94.8,90.9,99.5,97.0,54.2,95.8
3,6,Princeton University,us,5,60.1,61.7,100.0,32.9,50.4,39.4,...,"8,279",8.0,23%,46 : 54,92.4,87.6,95.9,99.1,66.0,80.3
4,7,University of Oxford,gb,2,59.5,49.9,59.7,51.4,57.6,71.4,...,"20,965",10.6,42%,48 : 52,96.4,92.3,99.7,99.0,74.9,96.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
404,151-200,Aix Marseille University,fr,6月8日,NaN,19.0,0.0,18.6,21.5,48.1,...,"70,054",17.4,13%,60 : 40,47.0–48.7,40.5,24.9,72.3,41.5,63.2
405,301-400,Linkoping University,se,7月8日,NaN,19.1,0.0,13.2,10.6,32.0,...,"15,026",14.4,15%,52 : 48,48.9–51.1,23.5,39.8,78.0,61.8,70.8
406,301-400,University of Milano-Bicocca,it,9月10日,NaN,23.1,0.0,11.4,7.2,34.2,...,"29,057",29.2,5%,62 : 38,47.0–48.7,24.9,25.9,93.6,40.8,43.0
407,601-700,Palack媒 University Olomouc,cz,3月4日,NaN,20.5,0.0,6.6,6.6,21.8,...,"18,673",14.5,13%,69 : 31,24.4–29.7,19.6,19.9,40.0,37.8,59.3
408,901-1000,Gdansk University of Technology,pl,5月9日,NaN,12.9,0.0,6.6,0.0,20.5,...,"14,816",19.9,5%,38 : 62,18.4–24.3,17.7,15.1,33.3,45.0,29.9

In [8]:
sample_rank = merged_rank.loc[:,['Name','RankShangHai','RankQS','RankTHE']]
sample_rank

                                Name RankShangHai    RankQS    RankTHE
0                 Harvard University            1         5          2
1                Stanford University            2         3         =3
2            University of Cambridge            4         2         =3
3               Princeton University            6       16=          7
4               University of Oxford            7         4          1
..                               ...          ...       ...        ...
404         Aix Marseille University      151-200      490=    301-350
405             Linkoping University      301-400      320=    251-300
406     University of Milano-Bicocca      301-400   601-650    301-350
407       Palack媒 University Olomouc      601-700   651-700  1001-1200
408  Gdansk University of Technology     901-1000  801-1000  1201-1500

[409 rows x 4 columns]

In [9]:
sample_rank = merged_rank.loc[:,['Name','RankShangHai','RankQS','RankTHE']]

def level(rank,rankname):
    for index, item in enumerate(rank[rankname]):
        item=str(item)
        if '=' in item:
            rank.at[index, rankname] = item.replace('=','')
        if '+' in item:
            rank.at[index, rankname] = item.replace('+','')
        if '-' in item:
            numbers = item.split('-')
            num1, num2 = map(int, numbers)
            # print(numbers)
            avg = str(int((num1+num2)/2))
            rank.at[index, rankname] = avg
    rank = rank.reset_index(drop=True)
    return rank
sample_rank = level(sample_rank,'RankQS')
sample_rank = level(sample_rank,'RankTHE')
sample_rank = level(sample_rank,'RankShangHai')
sample_rank.RankQS = sample_rank.RankQS.astype(int)
sample_rank.RankTHE = sample_rank.RankTHE.astype(int)
sample_rank.RankShangHai = sample_rank.RankShangHai.astype(int)

In [10]:
sample_rank

                                Name  RankShangHai  RankQS  RankTHE
0                 Harvard University             1       5        2
1                Stanford University             2       3        3
2            University of Cambridge             4       2        3
3               Princeton University             6      16        7
4               University of Oxford             7       4        1
..                               ...           ...     ...      ...
404         Aix Marseille University           175     490      325
405             Linkoping University           350     320      275
406     University of Milano-Bicocca           350     625      325
407       Palack媒 University Olomouc           650     675     1100
408  Gdansk University of Technology           950     900     1350

[409 rows x 4 columns]

In [90]:
def MJ(rank):
    rank_number = rank.shape[1] - 1
    rank = rank.set_index('Name')
    rank['MedianRank'] = rank.median(axis=1)
    rank['RankMJ'] = 0
    rank['Temp'] = 0.0
    unique_medians = rank['MedianRank'].unique()
    sorted_medians = sorted(unique_medians)
    
    rankMJ = 1  # 初始化排名
    # 对每个中位数分组内的学校进行排序
    for median in sorted_medians:
        # 找出所有中位数排名相同的学校
        tied_df = rank[rank['MedianRank'] == median]
        
        # 如果只有一个学校，则直接分配当前排名
        if len(tied_df) == 1:
            rank.loc[tied_df.index, 'RankMJ'] = rankMJ
            rankMJ += 1
        else:
            # 如果有多个学校并列，根据其他排名的中位数来分配先后顺序
            for i in range(len(tied_df)):
                t = []
                label = False
                for j in range(rank_number):
                    if tied_df.iloc[[i],[j]].values == tied_df.iloc[[i],[rank_number]].values and label == False:
                        label = True
                    else:
                        t.append(tied_df.iloc[[i],[j]].values)
                tied_df.iloc[[i],[rank_number+2]] = np.median(t)
            # 根据平均排名对并列的学校进行排序
            tied_df = tied_df.sort_values(by='Temp')
            aaa = tied_df['Temp'].value_counts()
            # 分配排名
            cal=0
            for idx in tied_df.index:
                rank.loc[idx, 'NewMedianRank'] = tied_df.loc[idx,'Temp']
                rank.loc[idx, 'RankMJ'] = rankMJ
                cal += 1
                if tied_df.loc[idx,'Temp'] in aaa.index:
                    if cal == aaa[tied_df.loc[idx,'Temp']]:
                        rankMJ += aaa[tied_df.loc[idx,'Temp']]
                        cal=0
                    
    return rank.drop('Temp', axis=1)

df = MJ(sample_rank)
df

,RankShangHai,RankQS,RankTHE,MedianRank,RankMJ,NewMedianRank
Name,,,,,,
Harvard University,1,5,2,2.0,1,NaN
Stanford University,2,3,3,3.0,2,2.5
University of Cambridge,4,2,3,3.0,3,3.0
Princeton University,6,16,7,7.0,5,NaN
University of Oxford,7,4,1,4.0,4,NaN
...,...,...,...,...,...,...
Aix Marseille University,175,490,325,325.0,167,332.5
Linkoping University,350,320,275,320.0,161,NaN
University of Milano-Bicocca,350,625,325,350.0,185,475.0
Palack媒 University Olomouc,650,675,1100,675.0,305,875.0
Gdansk University of Technology,950,900,1350,950.0,401,1125.0

In [85]:
s = pd.Series([1, 2, 3, 4], index=[0.1, 0.2, 0.3, 0.4])

# 选择索引为0.1的数据

print(s.index)

Index([0.1, 0.2, 0.3, 0.4], dtype='float64')

In [12]:
sample_rank2 = merged_rank.loc[:, ['Name','Alumni','Hici','PUB','PCP']]
sample_rank2

                                Name Alumni   Hici    PUB   PCP
0                 Harvard University  100.0  100.0  100.0  86.7
1                Stanford University   45.6   73.6   67.5  58.0
2            University of Cambridge   78.9   45.1   63.6  60.4
3               Princeton University   61.7   32.9   39.4  76.7
4               University of Oxford   49.9   51.4   71.4  48.5
..                               ...    ...    ...    ...   ...
404         Aix Marseille University   19.0   18.6   48.1  19.0
405             Linkoping University   19.1   13.2   32.0  19.1
406     University of Milano-Bicocca   23.1   11.4   34.2  23.1
407       Palack媒 University Olomouc   20.5    6.6   21.8  20.5
408  Gdansk University of Technology   12.9    6.6   20.5  12.9

[409 rows x 5 columns]

In [13]:
sample_rank2 = merged_rank.loc[:, ['Name','Alumni','Hici','PUB','PCP']]
sample_rank2['RankAlumni'] = sample_rank2.Alumni.rank(method='average',ascending=False).astype(int)
sample_rank2 = sample_rank2.drop('Alumni',axis=1) 
sample_rank2['RankHici'] = sample_rank2.Hici.rank(method='average',ascending=False).astype(int)
sample_rank2 = sample_rank2.drop('Hici',axis=1) 
sample_rank2['RankPUB'] = sample_rank2.PUB.rank(method='average',ascending=False).astype(int)
sample_rank2 = sample_rank2.drop('PUB',axis=1) 
sample_rank2['RankPCP'] = sample_rank2.PCP.rank(method='average',ascending=False).astype(int)
sample_rank2 = sample_rank2.drop('PCP',axis=1) 
sample_rank2

                                Name  RankAlumni  RankHici  RankPUB  RankPCP
0                 Harvard University           1         1        1        1
1                Stanford University           7         2       16        4
2            University of Cambridge           2        10       23        3
3               Princeton University           3        30      126        2
4               University of Oxford           6         5       12        5
..                               ...         ...       ...      ...      ...
404         Aix Marseille University         186        97       71      191
405             Linkoping University         185       159      205      190
406     University of Milano-Bicocca          97       184      175      104
407       Palack媒 University Olomouc         154       287      355      159
408  Gdansk University of Technology         347       287      367      351

[409 rows x 5 columns]

In [14]:
df = MJ(sample_rank2)
df

,RankAlumni,RankHici,RankPUB,RankPCP,MedianRank,RankMJ
Name,,,,,,
Harvard University,1,1,1,1,1.0,1
Stanford University,7,2,16,4,5.5,2
University of Cambridge,2,10,23,3,6.5,4
Princeton University,3,30,126,2,16.5,11
University of Oxford,6,5,12,5,5.5,3
...,...,...,...,...,...,...
Aix Marseille University,186,97,71,191,141.5,135
Linkoping University,185,159,205,190,187.5,185
University of Milano-Bicocca,97,184,175,104,139.5,132
Palack媒 University Olomouc,154,287,355,159,223.0,231
Gdansk University of Technology,347,287,367,351,349.0,362